package _03Matrix;
import java.util.Scanner;

public class _00Demo {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);

        /*В Java матрицата представлява двумерен масив – структура от данни,
        Можем да си я представим като таблица с клетки, където всяка клетка
        съдържа стойност от определен тип
        (например int, double, String и др.).*/

        //📌 Създаване на матрица
        //1.  Деклариране на матрица
        // --> Това създава променлива matrix, която ще сочи към двумерен масив от цели числа.

        int[][] matrix;

        //2. Инициализиране на матрица
        // --> Тук се създава матрица с 3 реда и 4 колони, запълнена с нули по подразбиране.

        matrix = new int[3][4];

        //-------------------------------------------
        //3. Комбинирано деклариране и инициализиране
        //------------------------------------------

        int[][] matrixA = {
                {1, 2, 3},
                {4, 5, 6},
                {7, 8, 9}
        };

        //🛠️ Достъп до елементите
        // За достъп до конкретен елемент използваме два индекса:

        int x = matrix[1][2]; // достъп до елемента на 2-ри ред и 3-та колона (стойност 6)

        //------------------------
        //🔁 Обхождане на матрица
        //------------------------

        //Със стандартни for цикли: --> Достъп до елементите по индекси

        for (int r = 0; r < matrix.length; r++) {
            for (int c = 0; c < matrix[r].length; c++) {
                System.out.print(matrix[r][c] + " ");
            }
            System.out.println();
        }

        // С for-each: --> просто обхождаме Матрицата без да достъпим индексите

        for (int[] row : matrix) {
            for (int value : row) {
                System.out.print(value + " ");
            }
            System.out.println();
        }

        //-------------------
        // 📏 Особености
        //-------------------

        // --> В Java матрицата е масив от масиви,
        // така че не е задължително всички редове да са с еднаква дължина.

        int[][] unevenMatrix = {
                {1, 2, 3},
                {4, 5},
                {6}
        };

    }

    // String запълване на матрица

/*    public static void enterMatrix(String [][] matrix, Scanner scanner) {

        for (int row = 0; row < matrix.length; row++) {
            matrix[row] = scanner.nextLine().split("\\s+");
        }
    } */
}
